import pytest

from src.services import search_by_phone_number


@pytest.fixture()
def data_list():
    return [
        {
            "Дата операции": "18.11.2021 21:15:27",
            "Дата платежа": "19.11.2021",
            "Статус": "OK",
            "Сумма операции": -200.0,
            "Валюта операции": "RUB",
            "Категория": "Мобильная связь",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        },
        {
            "Дата операции": "18.12.2021 21:15:27",
            "Дата платежа": "19.12.2021",
            "Статус": "OK",
            "Сумма операции": 500.0,
            "Валюта операции": "RUB",
            "Категория": "Аптеки",
            "Описание": "Дежурные аптеки",
        },
        {
            "Дата операции": "29.09.2021 18:48:24",
            "Дата платежа": "29.09.2021",
            "Статус": "OK",
            "Сумма операции": -100.0,
            "Валюта операции": "RUB",
            "Категория": "Мобильная связь",
            "Описание": "Я МТС +7 921 11-22-33",
        },
    ]


@pytest.fixture()
def expected_list():
    return [
        {
            "Дата операции": "18.11.2021 21:15:27",
            "Дата платежа": "19.11.2021",
            "Статус": "OK",
            "Сумма операции": -200.0,
            "Валюта операции": "RUB",
            "Категория": "Мобильная связь",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        },
        {
            "Дата операции": "29.09.2021 18:48:24",
            "Дата платежа": "29.09.2021",
            "Статус": "OK",
            "Сумма операции": -100.0,
            "Валюта операции": "RUB",
            "Категория": "Мобильная связь",
            "Описание": "Я МТС +7 921 11-22-33",
        },
    ]


def test_search_by_phone_number(data_list, expected_list):
    assert search_by_phone_number(data_list) == expected_list
    assert search_by_phone_number([]) == []
